{"pageProps":{"markdown":{"content":"**Waku's website Privacy Policy**\n\nThe goal of Waku is widespread adoption of the decentralized web. Our\nchallenge is achieving mass adoption while staying true to our\nprinciples, which include privacy and transparency.\n\nWe believe privacy is the power to selectively reveal oneself to the\nworld. For us, it’s essential to protect privacy in communications.\n\nGuided by our principles, Waku is designed to be a tool that allows you\nto protect your privacy and to process as little personal data as\npossible for the network to thrive.\n\nIn this Privacy Policy, we explain how Waku strives to only request data\nthat’s useful and required, not to hold that data longer than necessary,\nand to give you as much control as possible over your data.\n\n**1**\n\n**Who we are**\n\nWhenever “Waku” or “we” is used in this Privacy Policy, we’re referring\nto Status Research & Development GmbH, a Swiss company. Our contact\ninformation can be found on our website and at the end of this Privacy\nPolicy.\n\n**2**\n\n**Our role in your privacy**\n\nWaku is the communication layer for Web3. Decentralized communication\nthat scales. Private, secure, and it runs anywhere. Waku is being used\nby (i) Waku Connect: The communication layer for Ethereum. A tech stack\nenabling decentralized communication between DApps and people; (ii)\nStatus: Status is a secure messaging app, crypto wallet, and Web3\nbrowser built with state of the art technology; and (iii) WalletConnect:\nWalletConnect v2 is using Waku v2 for decentralized messaging\ninfrastructure.\n\nIf you decide to run a node or implement Waku, or submitting any\nquestions or comments through e-mail or on our social networks, or just\nvisiting our website, this Privacy Policy applies to you.\n\nWhen Waku collects and processes personal data for our own purposes\n(which we don’t do often), such as Community support or to process your\ninput and/or feedback left on our (social media) pages, Waku acts as the\n‘data controller’ of information. This means we determine how and why\nyour data are processed.\n\nThis means we process these data strictly on your behalf, and we will\nnever process the data for our own purposes.\n\nPersonal data means all information by which a person can be directly or\nindirectly identified, in line with the definitions of the General Data\nProtection Regulation (GDPR), the Swiss Federal Act on Data Protection\nof June 19, 1992 (DPA) and its ordinances, and other relevant\nlegislation on the protection of personal data. When we refer to privacy\nlegislation in this Privacy Policy, we mean GDPR and all such relevant\nlegislation.\n\n**3**\n\n**How and why we use your data**\n\nUnder relevant privacy legislation, Waku can only use your data for\ncertain reasons and where we have a legal basis to do so. Beyond the\nlaw, it’s our policy to store and process only those data that are\nessential for community support and to respond to your input on our\nsocial media pages and if necessary. Waku won’t process or store any\ndata that we don’t need, and in such case, we only store personal data\nfor the least amount of time needed for these purposes.\n\nHere are the reasons why we process your data:\n\n- Ethereum is a public blockchain\n\nEthereum is the community-run technology powering the cryptocurrency\nether (ETH) and thousands of decentralized applications (DApps). Waku is\nthe communication layer for Web3. Decentralized communication that\nscales. Private, secure, and it runs anywhere.\n\nThe Ethereum public network is accessible to anyone in the world with an\ninternet connection. Anyone can read or create transactions on a public\nblockchain and validate the transactions being executed. Therefore,\ninformation you share on the Ethereum blockchain is public.\n\nPlease be aware that when sharing information on the ETH network it is\nstored publicly and immutably.\n\n- When you you decide to run a node or implement Waku, you are the\n  sole owner and possessor of your private keys and therefore\n  responsible for their storage or loss. This means that Waku doesn’t\n  know which keys belong to you and doesn’t process any personal data\n  in this respect.\n\nThis means, that your private keys are stored by you in the way you\ndecide, and Waku has no access to such private keys and doesn’t process\nany personal data in this respect.\n\n- Data processed through external (social media) pages:\n\n  - **Personal Data:**\n    Information you make public when you leave a comment or otherwise post something on our external (social media) pages- For example, Waku has pages on the following (social media) platforms:Facebook, Twitter, Instagram, YouTube,Reddit, GitHub, Discuss and Discord.\n\n  - **Purpose(s):**\n    We may use these data to:- Contact you via our (social media) pages- Process your input and/or feedback left on our (social media) pagesWe will explicitly not gather any more information about you or link your social media account to your chat name, ENS name, or IP-address.\n\n  - **Legal basis:**\n    Legitimate Interest:- Necessary to get in touch with you regarding your message- Process your input, respond to feedbackOur external (social media) pages are also controlled by the platform itself.Please check the social media privacy policies,to see how each platform handles your personal data.\n\n  - **Stored:**\n    As long as your message is available on the pages concerned,in accordance with the page’s privacy policy,or until you delete the message.\n\n- Community support\n\nWaku is an open-source project made by people all over the world. We\nhave many ways to stay in touch, including via email and social media\nplatforms.\n\nData processed when you contact us:\n\n- **Personal Data:**\n  Your chat name or ENS name and all (personal) data you share with using your message on social media platforms.- Your email address when you send us an emailPlease note: as a rule, your chat name is generated by you or on your own devices.Your chat name will only beKnown by us if you decide to contact us.\n- **Purpose(s):**\n  We use these data to:Contact you about your messageProvide you information and/or support.\n- **Legal basis:**\n  Consent and Legitimate Interest :- Necessary to contact you about your message to provide you the support you requested- You give your consent to being contacted by reaching out to us.\n- **Stored:**\n  As long as needed to resolve your concern.\n\n**4**\n\n**How we work with third party processors**\n\nWaku won’t share your personal data with third parties.\n\nHowever, Waku may engage (sub) processors that we trust to carry out the\nprocessing of personal data on our behalf. We only provide personal data\nto (sub) processors when necessary for them to execute the services they\nprovide to us. We’ve established contractual agreements with all our\n(sub) processors ensuring that they may only process the personal data\ncollected and processed by us within the scope of the contractual\nagreement and under no circumstances for other purposes.\n\nAs Data Controller: Waku may use (sub) processors to assist us in our\nservices provided as data controller. Our use of processors is under\ncontractual agreement and in accordance with privacy legislation.\n\nAs Data Processor: Waku may also use sub-processors to assist us in our\nservices. Our use of sub-processors is under contractual agreement and\nin accordance with privacy legislation.\n\n**5**\n\n**Exporting data outside the European Union**\n\nWaku may transmit personal data to parties outside the European Union,\nif one of our (sub) processors is established outside the European\nUnion. Personal data will only be processed in countries or by parties\nthat provide an adequate level of protection in accordance with European\nstandards. The transmission of data outside the European Union will\nalways happen in conformity with privacy legislation.\n\n**6**\n\n**We’re serious about data security**\n\nWaku protects the personal data we process from unauthorized and\nunlawful access, change, disclosure, use, and destruction. For example,\nwe take the following technical and organizational security:\n\nWe encrypt many of our services using SSL and other security measures.\n\nWe review our information collection, storage, and processing practices\nand handbooks, from time to time, to guard our systems against\nunauthorized access.\n\nWe restrict access to personal data to our contributors and all other\nparties we work with on a need-to-know basis, subject to strict\ncontractual confidentiality obligations.\n\nWe perform periodic internal security audits.\n\n**7**\n\n**A quick bite on cookies**\n\nCookies are necessary for the technical operation of our website. When\nwe have to use cookies, we choose cookies that don’t hold any\nuser-specific information and are essential for the operation of the\nwebsite.\n\n**8**\n\n**This Privacy Policy might change**\n\nWe might modify or replace any part of this Privacy Policy. Please check\nour website periodically for any changes. The new Privacy Policy will be\neffective immediately upon posting to our website.\n\nYour choices and rights\n\nAs explained throughout this Privacy Policy, Waku collects very little\ninformation about our users. As a result, it might be difficult to\nverify whether a request regarding privacy rights has actually been\nsubmitted by the person concerned.\n\nAs laid out in relevant privacy legislation, you have the right to:\n\n- Ask us to correct or update your personal data (where possible);\n\n- Ask us to remove your personal data from our systems;\n\n- Ask us for a copy of your Data processed, which may also be\n  transferred to another data controller at your request;\n\n- Withdraw your consent to process your personal data (only if consent\n  was asked for a processing activity), which only affects processing\n  activities that are based on your consent and doesn’t affect the\n  validity of such processing activities before you have withdrawn\n  your consent;\n\n- Object to the processing of your personal data;\n\n- File a complaint with the Federal Data Protection and Information\n  Commissioner (FDPIC), if you believe that your personal data has\n  been processed unlawfully.\n\nStatus Research & Development GmbH\n\n> Baarerstrasse 10\n>\n> 6302 Zug\n>\n> Switzerland\n\nYou can message us directly in any of our social media platforms. Keep\nin mind, any information shared in the public channels or as a comment\nor post in any of our social networks won’t be private. When personal\ndata is shared in this way, it will not be protected by Waku or covered\nby this Privacy Policy. To contact us privately, please email us at\nlegal@status.im.\n\nThis document is: Waku_PP_June2022.\n","metadata":{},"toc":[]},"navProps":{"metadata":{"published":true,"title":"privacy-policy"},"navOrder":-1,"localPath":"privacy-policy.md","path":["privacy-policy"],"children":[],"isDir":false},"routeParams":{"path":["privacy-policy"]}},"__N_SSG":true}